it/xml/xml소설같은xml/novelxml_src/17_SAAJ_Client_Programming/SAAJwithDOM/build/SOAPMessage.xml

<?xml version="1.0" encoding="UTF-8"?>

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                   xmlns:enc="http://schemas.xmlsoap.org/soap/encoding/"
                   xmlns:ns0="http://localhost:8080"
                   env:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<env:Body>
		<ns0:sayHello>
			<String_1 xsi:type="xsd:string">Micheal</String_1>
		</ns0:sayHello>
	</env:Body>
</env:Envelope>